#include <stdio.h> //<------<<<
#include <string.h>
int main() {
  char s[50];
  char a[11] =
      ">>>------>"; // 将字符串赋值于数组变量中，注意防止数组爆掉应定大点的数组
  char b[11] = "<------<<<";
  while (gets(s)) {
    if (strcmp(s, a) == 0 ||
        strcmp(s, b) == 0) // 字符串对比函数strcmp将两字符串对比，
    {
      printf("Yes\n");
    } else {
      printf("No\n");
    }
  }
  return 0;
}
// if(((a[0]=='<')||(a[0]=='>'))&&
//                ((a[1]=='-')||(a[1]=='>'))&&
//                ((a[2]=='-')||(a[2]=='>'))&&
//                ((a[3]=='-')||(a[3]=='-'))&&
//                ((a[4]=='-')||(a[4]=='-'))&&
//                ((a[5]=='-')||(a[5]=='-'))&&
//                ((a[6]=='-')||(a[6]=='-'))&&
//                ((a[7]=='<')||(a[7]=='-'))&&
//                ((a[8]=='<')||(a[8]=='-'))&&
//                ((a[9]=='<')||(a[9]=='>')))
